Revit 2024 API
RibbonPanel.GetItems Method
Gets a copy of the collection of RibbonItems assigned to the RibbonPanel.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<RibbonItem> GetItems()
Visual Basic
Public Function GetItems As IList(Of RibbonItem)
Visual C++
public:
IList<RibbonItem^>^ GetItems()
Remarks
This method gets the items assigned to the RibbonPanel.
See Also
RibbonPanel Class
Autodesk.Revit.UI Namespace